In [189]:
import numpy as np
import pandas as pd

In [5]:
labels = ['a','b','c']
my_data = [10,20,30]
are = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [7]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data = my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(are)

0    10
1    20
2    30
dtype: int32

In [17]:
pd.Series(are,labels)

a    10
b    20
c    30
dtype: int32

In [23]:
pd.Series(d)  #d -> dictionary

a    10
b    20
c    30
dtype: int64

In [25]:
d

{'a': 10, 'b': 20, 'c': 30}

In [27]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [29]:
ser1 = pd.Series([1,2,3,4],['usa','usb','usc','usd'])

In [31]:
ser1

usa    1
usb    2
usc    3
usd    4
dtype: int64

In [33]:
ser2 = pd.Series([1,2,5,6],['usa','usb','use','usf'])

In [35]:
ser1 + ser2

usa    2.0
usb    4.0
usc    NaN
usd    NaN
use    NaN
usf    NaN
dtype: float64

In [37]:
# data Framess

In [41]:
from numpy.random import randn

In [43]:
np.random.seed(101)

In [61]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['a1','b2','pink','white'])

In [65]:
df

         a1        b2      pink     white
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [69]:
df[['pink','a1']]

       pink        a1
A -1.385379  1.606780
B -0.771329  0.041460
C  0.649148 -0.804652
D  0.161781 -1.080471
E  0.783316  0.975720

In [71]:
df.b2

A   -1.115710
B   -0.411055
C    0.253548
D    0.902398
E   -0.388239
Name: b2, dtype: float64

In [75]:
df[['pink','a1']]

       pink        a1
A -1.385379  1.606780
B -0.771329  0.041460
C  0.649148 -0.804652
D  0.161781 -1.080471
E  0.783316  0.975720

In [77]:
df['n1'] = df['pink'] * df['white']

In [79]:
df

         a1        b2      pink     white        n1
A  1.606780 -1.115710 -1.385379 -1.329660  1.842083
B  0.041460 -0.411055 -0.771329  0.110477 -0.085214
C -0.804652  0.253548  0.649148  0.358941  0.233005
D -1.080471  0.902398  0.161781  0.833029  0.134768
E  0.975720 -0.388239  0.783316 -0.708954 -0.555335

In [81]:
df['n2'] = df['pink'] ** df['white']

In [83]:
df

         a1        b2      pink     white        n1        n2
A  1.606780 -1.115710 -1.385379 -1.329660  1.842083       NaN
B  0.041460 -0.411055 -0.771329  0.110477 -0.085214       NaN
C -0.804652  0.253548  0.649148  0.358941  0.233005  0.856333
D -1.080471  0.902398  0.161781  0.833029  0.134768  0.219287
E  0.975720 -0.388239  0.783316 -0.708954 -0.555335  1.189033

In [89]:
df.drop('n1',axis=1)

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
C -0.804652  0.253548  0.649148  0.358941  0.856333
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [91]:
df

         a1        b2      pink     white        n1        n2
A  1.606780 -1.115710 -1.385379 -1.329660  1.842083       NaN
B  0.041460 -0.411055 -0.771329  0.110477 -0.085214       NaN
C -0.804652  0.253548  0.649148  0.358941  0.233005  0.856333
D -1.080471  0.902398  0.161781  0.833029  0.134768  0.219287
E  0.975720 -0.388239  0.783316 -0.708954 -0.555335  1.189033

In [93]:
df.drop('n1',axis=1,inplace=True)

In [95]:
df

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
C -0.804652  0.253548  0.649148  0.358941  0.856333
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [97]:
df.drop('C',axis=0)

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [99]:
df

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
C -0.804652  0.253548  0.649148  0.358941  0.856333
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [101]:
df.drop('C',axis=0,inplace=True)

In [103]:
df

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [105]:
df.shape

(4, 5)

In [107]:
df

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [109]:
df.loc['A']     # rows

a1       1.606780
b2      -1.115710
pink    -1.385379
white   -1.329660
n2            NaN
Name: A, dtype: float64

In [111]:
df.loc['D']

a1      -1.080471
b2       0.902398
pink     0.161781
white    0.833029
n2       0.219287
Name: D, dtype: float64

In [113]:
df.iloc[2]

a1      -1.080471
b2       0.902398
pink     0.161781
white    0.833029
n2       0.219287
Name: D, dtype: float64

In [115]:
df.loc['D','pink']

0.161781188240493

In [117]:
df.loc[['D','A'],['n2','b2']]

         n2        b2
D  0.219287  0.902398
A       NaN -1.115710

In [119]:
df

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [121]:
booldf = df > 0

In [123]:
df[booldf]

        a1        b2      pink     white        n2
A  1.60678       NaN       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477       NaN
D      NaN  0.902398  0.161781  0.833029  0.219287
E  0.97572       NaN  0.783316       NaN  1.189033

In [127]:
df > 0

      a1     b2   pink  white     n2
A   True  False  False  False  False
B   True  False  False   True  False
D  False   True   True   True   True
E   True  False   True  False   True

In [129]:
df[df > 0]

        a1        b2      pink     white        n2
A  1.60678       NaN       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477       NaN
D      NaN  0.902398  0.161781  0.833029  0.219287
E  0.97572       NaN  0.783316       NaN  1.189033

In [133]:
df[df['pink'] > 0]

         a1        b2      pink     white        n2
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [135]:
df[df['b2'] > 0]

         a1        b2      pink     white        n2
D -1.080471  0.902398  0.161781  0.833029  0.219287

In [137]:
result = df[df['b2'] > 0]

In [139]:
result

         a1        b2      pink     white        n2
D -1.080471  0.902398  0.161781  0.833029  0.219287

In [141]:
result = df[df['pink'] > 0]

In [143]:
result

         a1        b2      pink     white        n2
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [145]:
result = df[df['pink'] < 0]

In [147]:
result

        a1        b2      pink     white  n2
A  1.60678 -1.115710 -1.385379 -1.329660 NaN
B  0.04146 -0.411055 -0.771329  0.110477 NaN

In [149]:
df[df['pink'] < 0]['a1']

A    1.60678
B    0.04146
Name: a1, dtype: float64

In [151]:
df

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [155]:
df[df['pink'] < 0][['a1','white']]

        a1     white
A  1.60678 -1.329660
B  0.04146  0.110477

In [159]:
df[(df['pink']>0)&(df['b2']>0)]  # Ampersent

         a1        b2      pink     white        n2
D -1.080471  0.902398  0.161781  0.833029  0.219287

In [161]:
df[(df['pink']>0)&(df['b2']<0)]  # AND Operator

        a1        b2      pink     white        n2
E  0.97572 -0.388239  0.783316 -0.708954  1.189033

In [165]:
df[(df['pink']>0)|(df['b2']>0)]   # OR operator

         a1        b2      pink     white        n2
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [167]:
df

         a1        b2      pink     white        n2
A  1.606780 -1.115710 -1.385379 -1.329660       NaN
B  0.041460 -0.411055 -0.771329  0.110477       NaN
D -1.080471  0.902398  0.161781  0.833029  0.219287
E  0.975720 -0.388239  0.783316 -0.708954  1.189033

In [169]:
add1 = 'aa bb cc dd'.split()

In [171]:
add1

['aa', 'bb', 'cc', 'dd']

In [177]:
df['optn'] = add1

In [179]:
df

         a1        b2      pink     white        n2 optn
A  1.606780 -1.115710 -1.385379 -1.329660       NaN   aa
B  0.041460 -0.411055 -0.771329  0.110477       NaN   bb
D -1.080471  0.902398  0.161781  0.833029  0.219287   cc
E  0.975720 -0.388239  0.783316 -0.708954  1.189033   dd

In [181]:
df.set_index('optn')

            a1        b2      pink     white        n2
optn
aa    1.606780 -1.115710 -1.385379 -1.329660       NaN
bb    0.041460 -0.411055 -0.771329  0.110477       NaN
cc   -1.080471  0.902398  0.161781  0.833029  0.219287
dd    0.975720 -0.388239  0.783316 -0.708954  1.189033

In [183]:
df

         a1        b2      pink     white        n2 optn
A  1.606780 -1.115710 -1.385379 -1.329660       NaN   aa
B  0.041460 -0.411055 -0.771329  0.110477       NaN   bb
D -1.080471  0.902398  0.161781  0.833029  0.219287   cc
E  0.975720 -0.388239  0.783316 -0.708954  1.189033   dd

In [187]:
os = ['g1','g2',]

In [229]:
a = {'A':[40,20,np.nan],'B':[30,np.nan,np.nan],'D':[1,'black',3]}

In [231]:
aa = pd.DataFrame(a)

In [233]:
aa

      A     B      D
0  40.0  30.0      1
1  20.0   NaN  black
2   NaN   NaN      3

In [201]:
aa.dropna()  #no na values in raw

      A     B  D
0  pink  30.0  1

In [209]:
aa.dropna(axis=1)   #no na values in column

       D
0      1
1  black
2      3

In [221]:
aa.dropna(thresh=2)  #min 2 non NA values in raw

      A     B      D
0  pink  30.0      1
1    20   NaN  black

In [225]:
aa.fillna(value='ok')  # filling NA values

      A     B      D
0  pink  30.0      1
1    20    ok  black
2    ok    ok      3

In [235]:
aa['A'].fillna(value=aa['A'].mean())

0    40.0
1    20.0
2    30.0
Name: A, dtype: float64

In [237]:
# Group by methord in pandas

In [325]:
data = {'Company':['A','A','B','C','B','C'],
        'person':['sa','sb','fa','rww','fb','rwx'],
       'salary':[10,20,30,40,50,60]}

In [327]:
df = pd.DataFrame(data)

In [343]:
df

  Company person  salary
0       A     sa      10
1       A     sb      20
2       B     fa      30
3       C    rww      40
4       B     fb      50
5       C    rwx      60

In [321]:
byComp = df.groupby('Company')

In [333]:
byComp.sum()

         salary
Company
A            30
B            80
C           100

In [293]:
byComp.mean()   #not require string in column

         salary
Company
A          15.0
B          40.0
C          50.0

In [323]:
byComp.std()  #not require string in column

            salary
Company
A         7.071068
B        14.142136
C        14.142136

In [341]:
byComp.sum().loc['A']

salary    30
Name: A, dtype: int64

In [345]:
df.groupby('Company').min()

        person  salary
Company
A           sa      10
B           fa      30
C          rww      40

In [347]:
df.groupby('Company').describe()

        salary
         count  mean        std   min   25%   50%   75%   max
Company
A          2.0  15.0   7.071068  10.0  12.5  15.0  17.5  20.0
B          2.0  40.0  14.142136  30.0  35.0  40.0  45.0  50.0
C          2.0  50.0  14.142136  40.0  45.0  50.0  55.0  60.0

In [355]:
df.groupby('Company').describe().transpose()['C']

salary  count     2.000000
        mean     50.000000
        std      14.142136
        min      40.000000
        25%      45.000000
        50%      50.000000
        75%      55.000000
        max      60.000000
Name: C, dtype: float64

In [357]:
df.groupby('Company').describe().transpose()

Company               A          B          C
salary count   2.000000   2.000000   2.000000
       mean   15.000000  40.000000  50.000000
       std     7.071068  14.142136  14.142136
       min    10.000000  30.000000  40.000000
       25%    12.500000  35.000000  45.000000
       50%    15.000000  40.000000  50.000000
       75%    17.500000  45.000000  55.000000
       max    20.000000  50.000000  60.000000

In [359]:
# Merging, Joining, Concatenating

In [ ]:
# Operations